[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
2181722537
548075170
3855292234
3563114196
3096760208
319173395
3609504524
1755956653
1498434211
1489538532
1546979056
1126226086
1705600506
42119399
1164080792
956059879
1110713679
2208325427
2193209781
2050084414
807735867
1784071146
2567982215
1904272131
4094172895
2335973765
1101885435
1203930554
3953133912
285228022
457555612
1047295772
2479461338
2723183869
164896319
550725541
636832958
1236368600
731068879
111128113
951324465
1667406874
1799670291
3490555325
740448377
1322929766
3996594715
682962404
146634229
2294861628
2949933194
3674355075
4271022687
1615282230
1336766502
208226003
2047599280
1342347917
3707395937
736368024
2712977865
3215288632
1489766119
3277425890
3737048253
3668402959
201567906
639639739
1821373030
3152145897
1525611752
1918239676
1207962299
1895355059
3806688882
3427233775
2881687966
1799866096
2858500591
2315661309
2706338275
2197475019
1840437464
2364671765
3943478658
2401129656
671970090
801776070
3542017937
2562284821
3886821983
2215851874
1353695531
3041753816
3996615859
3892129619
2220558096
1550109742
4152045006
441112878
1847022826
4082028235
2540705604
2103551908
2803823325
2997121454
3594370997
2251357549
4204909036
881258140
3595074329
951250602
1986812015
4198206325
1912858754
2123059967
3480402847
3029295582
1157178376
416292325
3847519726
1844067289
3944178517
220475928
2912861235
3389751137
3421976011
3279153437
2973841889
3236412165
3887176132
505146987
1477851979
4078064611
760452615
2700035045
652237298
2235103927
3149114739
1359361979
753224212
1705545668
1427292928
2657875436
2667911258
2535346225
4184597888
721823528
2946229568
1052519856
413402195
683049267
289632821
296854007
2796933266
3273209694
3863861351
2959536368
2416866701
1461756073
2960548288
2893916524
333451892
1865456993
4290951096
4261679824
1532126390
724563154
3242316746
2881715962
3906757056
3155462013
3979839182
3088132805
1133689864
3439454009
4168029808
4248433017
1040411792
2391182240
2444275074
1578307948
4021887369
4231138014
3480804628
1927692469
3082994347
1708257300
1708488553
748166396
1644602554
3951895943
3204806274
3358632971
3767079107
2702457244
498047783
2194111842
1643057254
1367908650
90559808
1033481825
2890636354
3136279731
1522369966
3606574935
3175507993
2086649599
2638526940
3351548801
40147523
2173561653
1797149774
66746582
2408345857
1857110808
3899351613
228242718
3441682396
77656804
3044417728
2931040105
2725684615
215483769
3220077519
3629403974
3467843825
4043497219
1988518755
3780923839
2280613375
3064215551
2968590682
3774435458
3439359124
1360038440
462663262
[unused237]
[unused238]
[unused239]
[unused240]
[unused241]
[unused242]
[unused243]
[unused244]
[unused245]
[unused246]
[unused247]
[unused248]
[unused249]
[unused250]
[unused251]
[unused252]
[unused253]
[unused254]
[unused255]
[unused256]
[unused257]
[unused258]
[unused259]
[unused260]
[unused261]
[unused262]
[unused263]
[unused264]
[unused265]
[unused266]
[unused267]
[unused268]
[unused269]
[unused270]
[unused271]
[unused272]
[unused273]
[unused274]
[unused275]
[unused276]
[unused277]
[unused278]
[unused279]
[unused280]
[unused281]
[unused282]
[unused283]
[unused284]
[unused285]
[unused286]
[unused287]
[unused288]
[unused289]
[unused290]
[unused291]
[unused292]
[unused293]
[unused294]
[unused295]
[unused296]
[unused297]
[unused298]
[unused299]
4277593716
3312829322
3217380708
56091288
490247508
829315160
2245277810
2976816164
864942730
2246699815
745586511
1510328189
1494198253
848128881
3020884107
864674487
2041434490
2092489639
3910758230
2201236655
1101907775
254569525
882399112
3021379374
1136130381
1044401618
1533809047
434045476
2308348490
3980805843
3189457552
146988611
3352400832
10565946
3497067301
473643457
1016841875
3321595221
2228063684
1797109758
1990422533
485463469
3072036293
3981762496
3452535345
4188525269
847698334
2425865203
2240437263
3337745083
2948207028
1856075173
4254853709
864942795
3351556771
2120114131
1738265797
2114539071
2441496843
2810421479
3017866386
3265829077
497134444
1791271074
3798139026
2212396681
3227173725
999334238
14177092
1510323402
2435680164
2634102466
3666785044
2473970882
3861837800
718424136
3612926680
229211613
2245900962
3458774156
2540065782
3796970912
3632350815
1026928756
2678704633
2818400534
3613186530
2608583677
4240369074
3176806076
1311843699
848127915
4197146180
3974650111
356087319
2576005379
171886758
3081009210
2500634984
583999928
1752917220
2950679810
2929588998
3027492971
4038637638
2826045825
1860652615
808806117
2656138787
401211498
847433064
2551483158
2699904586
2855720289
2955082410
369315086
840588719
1742136529
2662129702
4078804981
3553362273
36538691
1971538872
2827868305
1084727389
3233256206
4030233531
1360000074
764478385
3597627138
1420349841
3045022511
2378775366
2378779377
1608637670
2370996728
3401965061
271903915
3613601937
1512794193
847336149
3928266265
391243462
1871221615
729796064
2034148194
2365927569
732510573
1312131881
1915080917
3811375594
3507932181
1563750930
551287920
2054487515
3020887233
1498606295
1199793671
381260989
4037090848
3496434313
3773130590
374037232
3460898310
2092554703
1980314963
3271435994
2675289664
113567115
896566896
3376021752
393916757
2633924358
2122133504
2354648686
2295519362
553412256
2445456580
231728090
2450918613
1768469385
1488105941
2223807123
369500293
2880842439
3044392905
3369225948
4116013187
2074443444
897990646
3266025213
3521007413
1026654305
3979440085
3613135607
281790557
4212936508
4257816542
337235428
1602567453
3042033822
1036187599
3726304495
2173557700
2113796158
159663547
3860267879
55482346
1971534293
2979609357
730815978
3984347356
3222770065
3085786163
1796557599
4164236649
4019937752
723907398
1257200054
3187466375
1168541985
1239452857
2333646459
2212573984
170894115
384194108
55467685
2459741777
1381797805
2067978091
2998050180
2608115077
1957005222
1805166875
2269473515
3308404410
3178738352
2438709758
2734970704
3270907562
714120358
222023415
3089236829
788515759
386275385
980493783
2472598474
319552149
1556716569
730384323
1215447351
2240430134
1677974357
3046580772
3685330585
1627984440
245204
744747118
68675643
4115064110
2077658817
1479945881
1812201749
2080421033
3641743404
4040014500
3294965984
868877654
2037096428
202619720
3388977530
3433351850
3462333187
1485370604
3916840373
465208057
1938230667
3323180546
715033240
3128401872
352864558
1963848833
2642265133
3029290477
427867059
1408217147
1211233089
2696175220
443005038
2646606518
2072594339
68650007
2798983590
843007957
2621515742
3478325876
1191280979
276338973
2865977551
153234704
4253926346
3278587996
985674201
325225440
1899422126
1950308177
4282315164
984189120
930341365
3090652201
3044292246
2680632905
1630260676
4039837947
3476748171
3322414281
3923099706
2303123038
2091820673
922644238
654382529
1446407803
325281617
3365532814
2235918822
3929111687
2740637546
3892985958
170727310
3888537269
3392951820
3298004546
3631761933
3299300931
1161441077
1696391009
845220125
2235914803
2292935200
251369661
2180676460
3897246399
3948533356
3006458901
10561807
3771796040
1791250428
1640531493
3238641716
3055519460
1825558852
2723199665
2316531073
4157670854
1187730664
1042794304
3277143065
4147379445
2237323775
2858072079
1399698004
4006502359
3774812667
3321656794
2264443195
2960650972
3339152837
476518567
419047650
983019549
3341916169
3327193120
1121298566
3439572803
1486365896
4230337064
1458934427
781447971
1742153363
1672013342
2648462710
84072646
3981688378
1206401115
2094236579
2151353371
1136069696
4195680018
1005182957
136366266
3632261871
4250165021
3910734833
1378530689
1090571167
2108698914
2228262129
999602603
961520513
2455041347
406240506
769163817
481472838
664274188
2043272544
442758028
3605604691
486893331
1236033658
2177590383
2227993885
3008098818
145447400
2436455744
2686644204
4204020767
631553871
3717234080
205162791
3173469064
3020735371
1226763941
3842459573
2758632892
2423902798
3158862910
1892890177
1295544490
588250864
3217143635
3486596231
462166261
690607827
1721207273
3004773804
3719912364
2560058676
441257851
467587352
2023470714
3461354471
1167601678
3204953758
3880028217
871878897
2205904190
1347210660
3163244443
3949426485
2579236986
3732472902
1934676539
1639841548
4104281979
2660266966
485938710
3921298496
2435698593
1713405716
2425430939
3300804367
3002488703
849271271
921691981
2432434267
1776022856
1895250284
1932106328
1969455376
487830059
202055245
184548186
416079238
554611970
1196265324
2010327675
1467181141
1367104301
1151733750
2216258758
169809287
2158346538
2755687833
160448034
1271688533
2858202198
1172485754
472941701
4264704113
2044976976
1469940320
4249599395
75841489
864452378
1640757974
195323148
763670244
3553037448
2280464758
3481650176
2929492263
984473645
3025706752
948442053
1349670121
1381927983
890819964
773044080
1851511083
1473573141
1288905534
3626063798
1923796159
1788399546
2888247974
2451306927
134176532
2441647479
4057683946
1228551661
2197104911
3128421133
1327520699
1009343390
1831349603
3557849471
455705416
1908362796
2015430370
3973817436
1742639072
687654781
4264581947
738037420
230777010
3020103143
4217229760
1530934741
1393039893
3883754313
922659178
336227380
1068133443
276625340
624765600
2276750776
151653689
2501140105
2140776459
2245541727
373218706
746917358
77081066
3328086332
1608482109
757722406
1706059419
3124016335
3484345631
419234037
232904579
3026914588
2397940922
1961432554
1617102719
1831605386
298447629
847433129
1780306271
2041738475
1533934640
1164347295
1665529339
4084424486
3386374884
27099045
789167398
2045095651
4280894460
672670873
2980746006
2607238719
2696683837
3303330621
4278606313
2969012875
3374153057
3789612339
281086138
690255344
3177241930
920678013
2003504938
574181309
527943040
3570262906
2455562995
2308325357
787463532
3227975516
3936362963
2316663403
1390505218
3165625439
2270119534
3526962990
1569055865
955147207
1192703151
787190563
1567298939
110670696
1370761813
2407054516
579113501
3405563828
797143153
1044182277
4274663090
2317830076
847342868
3645951541
3688796735
4073734385
3797992517
3240855804
2984045667
3477572639
691587838
3829289227
658782932
136663819
4093130773
2901758233
1871507312
3192317608
662482494
1080831687
3267423963
1334111556
2073571569
591530518
3324450243
4214068905
1026654242
3984860707
3395374354
2507745685
1153774294
2572973538
340695070
2560725090
2610667886
458139000
80965234
1450309995
3921051854
1895142457
657866672
3981076150
3887153055
1829308211
693516121
3144141263
239609056
3409733547
3288315736
2778464975
284985815
2512230772
1722812218
3782966009
1425165157
411439182
1227148762
3555099809
2866180286
475355132
307116330
3875004417
1055128281
972046937
3175273515
2218501604
2324879960
1350941857
1461868315
1483728447
841202953
1270097335
2977981541
560755624
4194974166
2024571798
2032588636
4076751559
510302644
159481522
3855579207
4054338747
2771551187
2008917703
3667821826
1760227267
3517459100
3435317336
668948617
3888541051
3410877567
4265016989
2074388883
943488512
4083394150
790057847
1053315971
2147233789
2349816609
3597449501
3207365616
981785909
2730883856
2154963842
786938771
3840309060
2850007887
3102547790
1550926672
3654624523
3149197448
2380084179
1330744651
427568874
4123574369
2245108812
3858629928
333514721
4054639371
2155781000
1640484708
2606734789
292463917
3460934208
442195005
2998938176
2371016410
2751040622
1346868190
3653034873
1517923320
3170659890
3435789442
3957282260
2236753983
1489853587
249041977
739928912
1632503783
3101422781
1798853811
1671343669
2389405982
1815669590
3851597775
3135793690
3790258943
2167232060
1987872597
140397151
3387140397
583219025
3394264871
2425773612
2049340176
3571472842
596495483
2555238338
2027655192
454414706
1127622492
1882751690
1448221026
4200620501
4213337050
4199976035
1971660243
1706305520
460223017
1036761522
1844282154
1110096058
296445671
1774142290
3842433558
163385334
2288543134
1641147863
3102510585
1532318149
2411119343
2921831278
2633009550
438333712
1207774595
4046184955
544858731
553889852
3094365125
1791020282
2578559908
863101465
2763880221
2284435665
2253975309
523429590
3449177457
1724308818
795870998
803511690
303725587
1556628286
254000342
1135977762
1445700190
2311511392
789531699
2944706318
2378774520
984169826
4041594837
1785947048
4281509206
2424699888
984188929
1235186970
1642797161
2565499684
566513497
540881623
2591771162
4188830768
3447475816
1757809293
3598841643
2042532599
1363396414
297431529
4200002273
437257260
1020983954
1827195540
3416753546
307128324
2101397045
1165784621
3630592375
552582925
1638514978
3333068821
2947704565
1543123576
3241732358
2165820178
2849252617
318578944
4055837298
2607264985
4109008486
4222177375
926346402
108435713
3088649317
3745210639
3199564020
3770013630
2421290234
1612941171
293648401
3303015575
2238523809
1498877332
850893258
1000430000
3808519543
369268410
3796056146
3857062390
111711661
2644789776
458571255
1646240771
2712000550
2619774757
2173956367
1143936913
568132367
1953355353
2303400133
995646639
1933070752
3014859915
3017712671
1378699947
3480866405
1315750939
1449747853
1634850551
2332110652
3170963248
3195453022
45235474
1576458330
3283452666
122879215
3484012269
1384383059
3814290349
3756615259
769761563
2335554958
3920818255
2401704646
4162122476
4196478026
1101740210
645703434
2941386486
3175484661
558599010
956205804
4291280580
3836034043
2501707602
2292855399
1390916045
3427098681
727434758
922646934
936303247
1044139216
3138068744
1919512432
2032262682
2939068167
2178213075
1940250743
4013429355
1193436720
1688374977
2788986246
745250027
1842657950
1149867477
3637703710
2330510286
712039584
3001636866
765621706
1251201585
4279707839
4013859210
768707311
3176032590
1660362024
479471573
863516905
4179845690
169168885
92087868
2349794202
602490605
1798001854
1337989724
3980618117
1505392777
3491494595
1837977669
664802229
706930633
3457008965
1396433519
3705148550
3360030550
2296607415
1457373101
2957327993
790332766
3114252492
873237057
768696890
1847810793
72462803
4290528049
361241218
971312576
815120341
4067953942
3423815998
634047253
253234136
1246378670
4147391860
4225048127
2062254002
3738162324
711983496
1969467717
2337277913
1169369148
984473836
3229951457
2839660270
2768249088
636296745
332168919
1311256019
3015004983
2066971450
1328927751
3387315712
238787263
2908671825
3572670210
2228258118
3848205681
1750450472
654397756
2410844681
335371246
871047426
1270241800
1378520726
442649082
3158728591
2553600004
1789671771
2627517191
1212312818
772121285
3631792581
662761381
2420616165
582308783
2195580821
2284479924
1008793945
4013364693
1753806220
3909344151
2296045452
2797318927
3615694379
2356187389
628238749
3708358330
2057435328
451273429
1934421686
2743179608
3967934018
461634938
3789977111
3284441709
2577848325
489744146
4061937066
3595956281
4280659919
2580655612
945587509
1514251499
1554854246
3445933937
1127898794
903268703
2242490802
2940321081
4159727
3591016636
1025570266
748675768
2235914856
330508951
1955807728
274369649
1914966924
923907245
3177116926
2526758698
805944739
1677880718
202304456
1110142365
1391790298
1272795573
1402842366
3222267440
2956940638
1135912778
451307706
4082874879
3990855418
1122737434
937360809
1555516106
610814047
267382112
1205009492
2208588587
3900879221
1188959235
4076370109
2948505799
3720686173
1157745900
337123721
706349668
3250408189
3577896940
3406615237
1816452419
298807770
1139187001
772606658
2131251073
1230501544
502885322
2057183682
521697915
2844185244
3436892620
231119408
683426977
2308333050
3273339532
3845133788
198164839
1302129371
1773950939
2662598035
130675187
1802765052
99882830
1808784473
2288950889
1120872673
3152639783
1700394707
2145332064
2160411443
3991455388
370687140
3740121930
385604832
3920591980
4265372010
1670181601
1228244851
576753320
3332282881
234322362
1404236550
441762686
3479273
2056803926
3695158789
2923299438
3383203046
1821515839
3465146541
3719561826
626899335
3428951573
2687354014
772419146
2091911181
495900615
3868339231
1124811984
4280922443
376472955
1124566046
2608867232
914018444
2724631617
3058108901
572305198
4250161297
130618741
2806561150
2666706651
3206345777
2277831644
2009563141
2642468133
4084497678
3366190704
3970085818
1257655137
3529721486
586764700
4126709185
1492919950
1036293358
68619108
1692288002
1306949936
3452514632
3013602341
2889075563
1670182034
3362824260
2154885904
2540497120
2589440184
3834249006
2001855001
2265858045
762501782
1725005989
3827617347
1101186461
2130895504
921410486
627863728
2424833583
3086543558
716863155
849645060
3790807820
3146547180
112122441
171894288
3189548056
3387579940
2091012060
726067642
2626234451
3431021573
3778978394
3667728696
1786856252
3253472672
1643442934
1514021942
3739797275
103689581
2585358101
3571798645
1635242581
1228946414
2940729858
253910814
3619064137
2940857128
3794643107
3478633680
4277079281
2878536037
2695770352
1639811798
304924876
777387197
3706141409
1743734328
2419730274
2972698667
2040640074
1954902136
4076645176
495444464
1248165721
2843213906
2673871321
2235678895
1856066418
1612413010
3427454997
2186773347
2650410480
2583193084
254606845
3224030097
1516744011
3154082001
2841654691
2455255924
3138071656
2884260692
2021321174
652280952
2406696067
347924096
3521778555
3489618478
666414272
1302193989
2284942693
2493658249
1574306773
995731635
3020442147
2033980123
769810417
3032415096
3369681273
4248513256
735881323
1084487640
1655758897
745524459
2400289388
3351116519
2025878318
3618352097
2240118341
2109284566
2446704928
2117839535
2601130720
4181036906
3119732080
3889502270
3891750802
79560210
427012147
1256653339
2476163727
3553843743
2723321415
601004707
2841393005
2407323766
2279787500
3904689405
4198337658
2064771106
3680483301
2158660624
551006241
1886730667
1010215930
1642601137
1212936487
4128613085
2183802036
3453961325
2620247798
58400440
3551787760
3249858194
845854901
2226013276
1511920712
2123886383
4080394700
3070374645
1133176756
2483770242
1711247091
1754581682
2311682485
1956448536
4054365519
704535327
2904141896
3054956309
324569186
3988866909
2202968485
4230721917
3545315677
1730915795
1175666860
4140076147
20729810
94424715
3743507136
3666646653
1384760687
1793378020
3261350609
2603892347
1717996182
2315932314
645026091
1289549702
705738081
177941526
3037709989
415705115
2026774778
1818192758
2823346558
3684679953
3876290407
2653321361
1411366366
413283293
1143005133
2455003793
3082291466
2032613681
1499265745
1157289721
2901138968
876576369
2517429252
960068349
700116948
578058097
2093021787
197122003
720886104
3674554568
3945872871
1776477810
1852841706
1908745314
103401278
1956601856
2579197995
1144216454
3653878341
2058913649
1887345755
2150509871
4070686441
862356529
1672387608
3226430046
2277603589
122392022
1298818109
1287474980
3744609453
3518022261
4011245578
1123478188
1856115401
1730665136
2193785385
3458797838
744623800
329439349
238574881
545718323
4114152477
2054170968
3457633539
1919364826
980319468
3810605792
2369896646
3895004719
3202965077
2689178949
1113919922
2635423814
3630293002
2464845183
1724803796
3509002802
888616567
235654872
560773666
427557402
2687928295
2864510434
1071652457
3761841608
2173523397
1623832865
1890081131
204805421
2283289626
3025831674
1744315023
2559976790
2040048962
1241191405
1845395422
2328827879
1210245032
3646295794
1394330055
3056843432
709242869
3509339979
535794149
210243863
1854481902
991535477
1721816294
1116016295
1959310123
3232436771
854343849
2432910316
1129153871
2914557841
585649706
2927831533
267703050
3922892266
3912588466
2358603557
1218210773
2739567845
255879071
3702011778
2653264070
3003587328
542870615
815150665
1121339748
1704628636
1157342666
3261904639
1944439791
2818907544
740865874
3434202258
104383122
1853422003
4234795114
889466090
1802565777
3376449315
1889381939
3637075593
1590943253
1125342283
2192730848
1844073467
1630726605
1097838048
1644985610
742363602
4111767242
1286211491
791239570
2949540058
2225022257
2343779753
3676285010
1693384495
1802097995
3222479286
2557992400
168654116
4019321572
788548123
1860548965
1823019353
2270648719
2099961448
3712124384
565959182
2028973848
1088803813
3384477198
2520914057
3007552462
1973132844
283531210
2074118467
2584039046
725121412
4290906155
1010875203
2331341246
3670859478
3874046201
674052045
4238618556
1789314402
2129912928
1023173642
2537154916
2439230034
2540308516
1196832845
1160577353
3634084529
3019600838
2029012936
1498572575
2034981859
4253374671
3054535155
2961257254
4115301875
1236334648
1544000058
829175281
2596603279
3092409952
682415212
558740540
547223791
2772041430
2988415564
3548508854
3449268694
548631302
1198338243
2207602062
3805953335
142069845
2155415144
1619531727
1892341763
862806893
3460130149
3131476271
1601101987
654683421
2370816021
4280521272
1134474183
1853362742
1131517121
25029696
991369196
1301
2639913241
4039948839
1360609309
744319898
3111157846
1277810858
2335491175
3828771332
833989850
2476320550
1784804593
3343806972
1657078373
3496114639
1693685257
1461036503
3033902326
238141023
4014513725
1750365477
1472289073
1703509531
3416363438
705484554
786959138
2506101166
3265931394
3575271691
4128499694
2003146843
338158639
1112217760
1072361115
3545546827
797929390
3680921353
60212135
2040194460
814650144
1413443235
692432150
3243365139
3138675493
3139460130
3774196827
3865891492
3386370901
2633382186
1695725765
2124009943
2985385993
4054263375
2667395102
1259006068
1135981781
3636227749
2402057495
461103033
3626545485
1746270150
2722180960
2464794668
1473553718
2608585553
3325393302
2769320933
3044729638
2404263203
3460870405
1889710945
1948461005
2671528568
964901740
2396668722
266476667
3512214407
3097565900
959660034
1592168538
1452910513
2266012711
913845599
393531767
389906059
3528751462
2922744526
3442338693
3922503314
2741458432
47511528
2199373107
1669202832
3478849342
4227634562
3892850813
3030769018
1058563346
561772341
2219222495
3476706207
1755812429
2280492819
4005145075
176895857
2907883759
3891715693
3979647654
3583936627
1999597569
119663541
2456055850
2428538011
3226233424
3211603442
2998175532
2769319283
79213850
4065034498
1519620518
124930264
991548207
698473825
1870507601
3143873098
2194820968
2510451141
50034828
1700974006
2380703069
1124326530
1752920112
4016716599
3135597833
4102310798
3709469262
4279562169
933754967
3436587359
3025376313
2152363679
1547062076
880022680
567273573
2201302375
1581404980
1781090489
2800459477
1919507649
4029097702
516725569
2218231456
2452850230
490767636
995319674
142898833
4189009325
1394763381
2026212739
2974941265
2855281095
3235557127
1950273483
495619376
746397073
1050164844
415796962
4268263804
999602538
2374936048
1566717871
3943307768
3473717770
273109174
554114553
751700140
742711519
2761881219
2097649670
2509415132
3180149491
3630337776
1070492626
3851140148
792021991
2544321639
1707618055
120462373
1264932855
2029912731
2785597638
1658125885
2195689394
3825907978
2861152184
713930883
4279572610
14363797
2795073388
740321667
3755084131
1491309557
562245783
2103456011
3635033643
3699234904
416403908
1506049780
2179346131
4176020365
2752296802
3237613966
2695500347
3194311288
2140668639
3189554341
242137249
2669597175
613024271
51292971
3593562348
1314631450
3111298614
2626684482
2046062697
1688784453
2977174608
3032406497
3506519373
1531048361
1681064515
2483988163
873188462
3901692263
4206701254
297220979
1909033571
1282463159
3584226561
2552949481
197828724
1355312510
365793983
2515004666
1506190245
67031239
1531955379
220631332
1900802106
2736549711
3693691320
1335061709
2268620147
70206646
1935568911
3139350203
1508460632
2423054916
4257777085
2578449573
230973553
1960958240
1468949994
1154859616
2580981103
285132555
739212064
3049325352
3138684373
3072209137
2809632382
3857764953
1532976523
3461187398
3619145516
2706092527
1032247739
4684646
1990746241
2027657880
2043644010
1224157002
2581923051
3930715082
1743805522
3077394558
883301046
1332451574
881297739
1494159291
2897508660
1886528608
2628324592
2864481961
237563443
4226264217
1824429351
2833572473
2884256674
2780338734
2056018356
2754791790
672765288
2085780440
2760467822
3453211982
327711052
3241631198
539336770
3856509645
1158664321
4247783432
3352364483
1161247632
1224846686
3574948261
136424724
1203399522
679439875
2183709088
2344354356
3547399458
1887094689
2533168099
669693272
367932328
3475304534
4160122596
1891629995
2845770604
1996943837
3385943620
2998383401
3355705357
2654571628
746142752
1494915489
2183159216
3599381072
3967778495
2622612551
2158316356
3450786584
1961452396
4129179773
2080646054
2759921231
1917146276
559634393
347328515
1377532550
1642392902
3465119379
1141043063
3793051476
1013338319
434494508
3805694717
2404805531
997012635
2633120879
2704070795
3988456748
3345904078
2331786847
4109723708
113633203
174936284
538566490
1797296792
2072624518
2940793032
1480709702
3854736013
2786948839
3285601035
3742648814
2990797263
688782622
2592770169
2946420915
3621152294
520798610
1876408910
184684446
329731663
1225981683
1570531220
2169476855
3899764710
2886580436
3924709317
1202446199
3720973349
980083357
1657065661
3267732055
1822080774
2820151333
26822692
2840499317
2216782301
644047205
1295343212
4000852904
479173493
374850792
1888282771
3180195709
3526881921
2068743236
1959414412
2675917177
3689632162
2809643292
713339778
394120821
74683531
2142778208
326790168
2292263952
4278743338
1087983993
3735306032
686060994
2413562357
1466694736
3131952455
4017678654
1582537354
3869032991
3317217921
1130103550
3716771849
277434929
3166043831
3293712428
271350678
3526382939
3365166955
1889194276
2126739221
4015225505
1727983920
1591176254
3641255925
1512773011
3153723496
3727024264
197509464
262673770
1724763895
550629057
36829414
2410840371
1444919084
1754106882
2992341512
3382401644
437629995
1647030117
1326374782
3689937298
1669467108
2739477829
3018440303
3086044306
867290491
163627582
860679140
4284275974
197675237
2369194207
195688567
3885091636
3088584582
3340709896
2879066144
677581910
1235041674
1140282497
567961043
2292076367
490490157
2185336156
1731562787
575757664
1634334010
1338376066
4153493870
3725920988
3995212698
1171613624
1757721227
397378122
3852383135
3177245564
269718601
157390717
2570519860
3378823317
3991233045
3376079754
3307938138
355751880
1219913427
3211464031
2233186467
3331022365
159898552
3038947145
928399458
473778896
826657498
2640290469
2532649956
1476616430
3346201941
2869954831
3113308059
3033122163
3030732248
3476737990
561640908
136819947
3383462640
1678335610
638477921
3930551848
1786810052
3163824952
4271528909
3445323642
2208356666
3369488737
351515810
2766591828
253959001
3346046383
4034048044
2779416981
2143732453
340820179
3094196265
288977205
3266956629
1087113132
2850012158
2261158082
3920468308
1089502326
2689808128
2218557522
2108500020
3662778384
742403353
606003112
3152144743
2013556220
117695292
3148729817
268019412
573179369
1186528932
4292199886
3100317628
3322400612
1412288726
2481709180
1456517410
4085505317
2197215866
1860960038
2808173104
3966914984
3797592675
707439342
1987703215
476325642
1082331953
790539398
1161202056
2210480645
118223734
832478022
3214834945
3218313257
1996994418
3458191057
1634231035
3531859426
1571192685
1023499727
538507925
3348425302
1723600484
1418815706
1197623683
294851254
1517740611
456895143
3506860767
3992731586
1079757258
980332754
2855194518
3882950325
927070902
441430238
1018645795
1932341906
248555583
587968878
1511134453
153191154
3321595158
2439876115
528857138
3625981516
3011211077
1421561026
514890154
885472289
816260722
3006193939
882112415
4182874281
732572384
2553761655
4040665203
748472371
1046474307
1439697368
1631948314
4162395856
2810703718
1228777602
2261487347
422518593
2236534159
353424230
4248408414
2840040587
4209872368
898209834
3633459726
2630751887
2244169598
2091778480
1178953853
2353827783
3633996330
2337332144
1808685226
2316731078
842851604
158204904
1622170593
3303610243
3945315326
2573984444
3217425642
3317873716
1504597763
2242486919
1805070499
2797039712
1979942038
2437597800
32075404
198520586
1845945753
59968067
644554486
2577285936
2997547162
3270115456
1183560238
114427795
4066806735
3687332996
3092985258
2116020180
3156802940
2736663528
3404792371
2755662767
1058671906
4122254106
363987042
3067617139
3619631990
1199243192
2789480697
4055850758
2223661670
2660885743
1425921948
2009087491
999334303
1006922303
1726583324
3190623913
2854597983
1688379354
1798014600
3354702990
1204432513
2567496764
3258005003
777005884
3824226371
3706252107
941965348
3976348087
1604389812
2781724959
579878243
2228063365
3132583778
600228607
4065888283
350089851
1627067552
1313769137
1110006830
2853598322
618293931
752228279
2978898710
3675518137
893500019
30933337
2956951445
3413433698
1214753061
14416426
2680814966
360836031
3358422655
2556395364
766590321
1777784488
3984476522
3978729504
1036061459
3362909889
3488502678
2493813177
3898114643
288412968
1116782747
1263368755
367500944
134921317
2699031276
580740394
1230619594
877281269
2135382779
2353863326
445024609
2281424867
3173560461
1460840377
2047801107
3709947838
1034759589
4125765115
3880266336
692731873
431435389
2630540684
936519747
175109851
2854921940
3625377019
814713984
2279069264
434202424
3880861424
1501551346
3094601250
512135877
125708764
3870828654
3313041125
3078496494
3261116193
3238378740
2037383049
400900752
3957810850
318370433
1181551625
2389668322
36013693
3993746058
3631047305
3580730219
1332200815
276356029
1332636893
4181314074
2762351471
3109591917
3320268056
3171547175
3514212840
2907093325
1358732029
3771632815
3386553513
1302935161
4156164540
2652479389
856514708
362713077
2397909774
290077345
2696442300
2603089770
2234685825
1505318687
2310684263
2758599526
1684071708
1644988611
410477835
3449393022
573270084
607390651
1757515392
3609636269
1386043868
3964927404
4244764437
459725929
3234546995
3814140684
1201228758
2386876558
1741216690
758957751
4032081332
1032981574
2973520654
1446454188
1607445483
1203949972
106167605
3446914150
2564633836
148170119
2066107096
1920609910
3275306121
2324882776
2249373843
1729373860
1657697259
2314866699
922773938
1980622548
2820625081
2313296014
1385118022
2911350808
1393497131
1793298402
66047839
1828168944
2083036545
3797381659
864677235
3575123150
201559628
462006159
2959655007
3082023093
4029122238
2190042915
1965737932
679156931
2514942377
3405377261
1282718557
1998505459
337298902
691082075
1608198840
1130561815
3907568719
1024078963
763127731
95223047
3334244017
1466412814
2246699750
2907439803
3830347224
503439348
591656021
1895186612
4120054298
2414302413
2376383438
3749076197
1303530483
154767984
724637275
3907872401
126110588
1296340058
1217418375
4227377776
1967351257
1777789921
3178004516
2454864479
3100162866
1064816684
2227993938
4059437264
3066203908
4129632109
3082774454
760393554
2901239152
1677648976
3615723958
3583037644
1328100369
1885494021
1484796837
3126305934
410571389
2088134314
1701620698
1343584062
3497585614
3159227639
3761940712
2211531992
2353290415
264967530
1768298629
3987105206
2032114530
2159236109
3306409941
3073540493
3606227784
1174954389
177738693
3291596809
2369724735
2039919994
3252204792
4001335084
422294441
2176007119
3916329650
3008256290
2381771807
1612329
1940774653
3237871799
1507938823
848460956
4225150663
3601846790
647837023
1969413148
1550632185
3240611376
2697591564
3066706499
589007945
2501809103
2223376311
1196144054
3120548107
2574023441
3604408873
1213952328
1332738929
436153631
2630417731
2632453396
1698248221
1477699602
187336317
2573080304
4216864532
572189080
831565404
4191212426
2669485304
902037518
202298075
3860751253
3250431264
1316723994
1722250288
1648381920
1724150757
1799890939
4015831472
3962656996
4061456659
3892206210
3158694928
1656807697
2584901139
3170969153
3540102864
828544551
37002047
3779507882
2201387562
3026823637
592940948
2639198222
2249599765
2723949543
756802250
1217702838
3228799546
416736008
462343552
1102578747
562301917
1031955040
2922497951
444995067
2980593495
1739264532
2242487244
471368264
1105961947
124113944
53993568
170085270
3698618551
2259574796
3137618538
3358943420
3880057195
3286388425
125092655
2538307605
3380136184
571968907
680772053
258298340
159212588
2712922682
910854967
3270068752
666215399
4232849021
3721377527
2806996107
1009961767
2079620689
894808924
3063609011
1449265503
3197136452
2970547709
2350947870
3265475385
3501317999
1453188033
2158512680
1555239730
1005974120
3685407561
1167467623
1013679087
4056887306
2888597915
4022582185
3814719820
2874745253
2763579912
338094294
956197130
294445535
1138908505
3134267429
516077520
4252679609
1161068063
4196960890
2535903823
392303768
381862452
4164622160
575252766
2608323194
1980627670
2601520291
1191321003
33079822
2753271467
3096640307
2382268455
1121569037
1270958167
2928497678
3284528390
3308077169
1202163624
2576266498
1848097323
3529447281
1010672039
4183511320
2710033160
416859436
3574811660
770790051
3336649324
962011781
3119245827
4170301676
3397658938
2948525969
2514959420
3625799318
2691878054
1920385271
1115237153
1101075756
1948422531
171213496
1721484887
3134654910
1179317332
3336613223
4237046170
2918730813
544016488
149257548
3302127113
3162179625
942010923
359757279
3047315183
376954525
2746647808
1125188141
897418744
2856460232
3109667483
3667126713
2672428864
2812681825
3414499238
890558041
3901835305
2145854
4179265767
3438674820
547287336
1063984063
2034137042
285338083
4169586299
1024216817
1734698653
3675653707
2615287260
851973058
510408091
2938426315
2020044499
1000261841
4278553956
793158322
974656738
1670278902
1048755897
927452060
3494456714
1660341273
4233498459
639689139
1254723959
3905875077
2231575537
1361083479
922666027
1391282601
146779984
2357189756
644912521
985517671
2918706674
34796366
2677098472
4188313765
3207614190
3599530007
1092315246
1728440155
2049048720
78797261
3174346898
4140915476
1471416065
3293709676
31975329
500712976
3188501888
2111852497
3043400257
580285428
2897094458
1850516944
2038686359
3242495771
2779424005
2513246640
1169636787
3967952502
1560344009
42470831
4057122089
657308638
1052774209
3846809984
791250575
1950900072
1648738527
166069336
3559359426
2373489897
2728927934
3294579237
346361592
3981073448
1917512174
3745810202
3631650782
1242523634
3989739778
2879626147
3976884877
917396375
1127574338
4082781420
2957106129
444325218
2892329255
2947050672
25971178
4188119821
2549772737
3423905214
3323006760
2408699324
2681797244
425996163
1813150277
3849440168
3497547953
77215479
1912454808
484220846
1375331044
1438652428
327066619
1322374143
1553750470
4204605488
2826942643
2076549153
762247642
4184920813
1003950429
3240988206
916637647
4271733865
334812944
1188392402
3186960948
3032221356
3395778430
932426730
3506512003
3860851029
932908335
116310845
2139498485
1434302998
2211426216
9666588
1388448186
170701147
4139855773
499851596
4115399805
817696863
3058075514
3270916547
357070742
3682705917
3390225719
1781880838
4175845135
1897570450
131612484
4182822404
1660787077
4208737591
2853079985
23033038
2136076818
1281049111
3042789487
2225335577
267363903
806915969
2679560900
2173683907
2728655786
1699601555
2118166422
1754571347
540631673
1639206788
1515882401
906548805
2302016962
192433313
1608611353
152705660
3241636405
57282195
1381205393
2061071937
2086907564
3249967120
2025041386
2783674983
4076023353
803451817
1622299157
359754012
1196422030
3351552914
1039211073
3512981310
2201911303
3178520202
1839400278
1207444821
1999842903
3007122163
1981773211
321283912
620002857
512154795
1715700803
1132381740
3841746797
1859716417
3817226230
2463747701
4066238209
3361445520
4064398903
4192711604
743994374
237302435
2551871383
2295226258
3239994676
2998967552
1980578323
1617897282
3187110158
2538343437
820093389
405074906
743121584
4004984072
3463457178
3768351630
588905216
1013073439
297102923
2885622432
1129656378
982855985
3892069165
3341260011
734345358
2656637679
2087039799
3822263935
969783990
3178539861
3475295492
39344059
1709089379
343136504
4083764951
157062338
658776450
2529276462
3178315084
382604013
3918584408
1406019630
2265461211
1110120469
4210330839
273207974
2335533441
1086211128
2481078046
932947
1791262604
1486431984
203844507
2068292023
871631996
1313418343
548586076
3568061416
607768893
1655911535
2537975677
2829986414
2875004407
3238999740
2184838590
1447429081
1231429260
263633971
1018564294
147834378
596783474
2924963870
3750861807
1713132177
684211059
1448044086
2495624303
1030849348
2488125872
3561431228
1479778913
2953692210
1004409598
3474318476
1298367879
298632824
1536464881
682466717
1338754156
3527283541
2949080493
1616020295
789796049
3223978766
155000303
4272582529
3037668049
1991327467
329968534
2277779888
3858440414
1418112409
1403031750
2878080031
657487951
4126021741
2310745329
3799686865
564981639
4187198653
915960177
1600143745
1613042156
985012233
3455045255
2988685477
2145917034
824285973
1074855850
254991316
1070894407
2292266187
894913589
1829035077
1848140524
397436315
141584690
3440016780
2608544364
1472007174
145935789
68366434
2508320024
3584098322
1753504260
3526989834
458006676
1656805712
4138756530
3393425093
3563330153
3691327432
3017312661
2594158530
2500596294
2843091805
2066405103
3507822178
1594866229
1530326485
2986207366
370453657
329993619
3572872418
2565757089
3463918540
944511459
3000259779
327066233
2682219159
1119057460
2712436610
101508925
1692395325
584596817
1961420093
764775406
146322068
1324428814
2567768985
403048641
3308338514
812775382
1611362324
3563486508
342527536
909803341
1813530579
3672341334
731082378
3901468832
1433058820
2264734108
282109570
2938941345
4176126650
1536189189
102924723
1512650900
2871161246
1947697703
3020102737
1818113610
2256986619
2097660994
872804739
2796160274
408061823
2151981010
438498188
497089279
3031535720
1454995451
2891222763
1085275179
1088803730
2136238266
2733345625
635078984
2247989274
437544053
134124677
68586357
288896494
3963553275
475500521
217475304
2740002515
1062989708
4163142877
3053191261
2269406227
2924157504
2136492785
3118324434
1925329554
662277073
3051415585
1914827782
1257402601
13836470
288362597
2541427441
1313485930
2172355864
477483992
1064960776
1615265726
1648411994
2134355095
1298455444
1735571899
724920028
4007848582
2864236111
955066399
3124134577
3166385211
3308378083
4227670081
4082785307
4285711684
963147203
2083787756
3979668172
4035269552
4139963921
1366656011
363138203
2041278324
362050516
1277960752
3455933937
1196094680
501305181
3708161320
897351649
3982296837
1717558361
1890295089
2914840336
3428759640
2843132506
4022346801
3299756517
3762621466
2593644151
2747138733
4215131388
314717479
3236389
2590761473
2555846303
1964101754
3073662049
1591037489
3529647907
1297996432
4140135879
1900580701
630099908
295249745
1524773881
780416211
3741016776
1679832993
2964096096
4074780360
1089482010
260291630
2302962194
1553069977
1171171921
1225330298
2427380654
2900796413
2779425030
22867313
77362795
900231311
4070775467
627895333
894143137
2146725438
592443159
3664431180
3039336331
1282994572
3293362689
345540777
607502569
1999649818
1164954789
2216806690
712266520
922353084
1619137493
345323799
756936503
3338881044
3848769680
1528600505
3766946391
854318664
2304397904
1931547231
828712139
356531967
3246948007
3798156669
3474716739
1911780371
630634476
662488749
892705091
167289597
3204037425
2389573273
812134348
1196209343
632701143
2516337934
1061928173
142277530
3066185041
2346421125
3171146212
2230066678
1279953846
718983412
95588437
3464562795
341639652
2673875018
1013071874
2411683428
1100001338
189362985
2307635612
1816598625
98506880
2246703125
3190179890
1046365429
1403977247
3550732492
678130981
846755001
4153486895
39450029
1787227244
1824151223
3303445938
3475675864
2076697271
1854862110
2389091232
384961118
579896844
3155411757
3584576092
2278960945
2250267699
4167878362
2991839546
1643698646
3182909425
1940721042
3693092957
2029666547
1918102373
3513956175
2065563102
1265667536
324834298
3858398705
1638678956
3941290082
56819536
517027878
4224847338
2934934354
3545031290
2248226494
2303357309
556305318
1172523049
24701710
3325174966
1671802324
2123089516
105021919
1099527723
2001223345
144896226
948185446
3692013916
2653015109
126094168
2281977668
3680253935
3948049697
3981457734
2619575740
888033959
2593078772
68022682
2823613166
3379292107
242850724
2654466731
1377713280
1415133746
3302003465
470443228
1289131630
114393412
1546787983
3502598308
2892127015
3573496113
2662082210
446853351
913806259
2053060835
3885696119
1165113669
3900000758
2183181191
1000548645
683300640
1779481790
59914592
781654332
651490104
2885832063
3293246869
500886685
2469817185
550969279
1362002431
3728415744
3986929804
3478871496
1213374094
1403167396
3284237878
2803419665
1624609654
1166626038
1385669038
3211229457
297732249
3299440986
602170785
2204028289
3634059049
2552083074
254195733
2538523320
2269415366
2403225972
2420867517
1582573325
1581220321
3195132964
2590648918
322381373
3047555985
1143485132
445465784
1334278256
1184460488
3679836589
3498536127
1825523519
2125726885
1931751054
1765478019
2997338360
2548676134
3708646870
2631450058
1656431281
2365204779
3439995933
3651442030
451899968
829417532
3151768010
3289156108
3762676068
1282422978
2277506337
75230498
986684722
2095024833
1798875110
413338275
2322473312
3843360416
3884927899
2738311709
300601730
872171367
2456580891
1144096755
879244499
2751636972
745216147
3493685162
3326623731
1825343636
3714872702
1219563927
2460097625
2096072814
3100263797
2242867838
188297497
2014261662
702872423
1581474057
2108628923
3071641491
3001103076
3565744080
2496069976
969579286
962134997
553312197
4061019030
751168574
1480213
618285683
3916288521
2825672388
283779655
3638079587
4288787335
284904728
635027880
3209978826
3847744696
2139853368
1467541177
1424427475
3393604375
3692529919
3192243695
1529374886
1126224662
870894319
2866063486
2536300114
854737118
3145203059
730872460
951713744
806020459
641047420
1833637900
2011882406
2616579108
1121466370
1614927232
395151678
2050711877
3692710372
202840689
2650597084
1599259341
3456221154
3194338362
3413370330
1510893512
2269489080
3178669575
2243071176
2890060425
2693368568
195040755
1328465772
4044202492
3965302180
3726874217
999368896
1365629476
1603989581
3833880638
2612725088
2446895259
170916119
288942976
822994576
1937482637
3690424396
1670762148
2213675625
2423988899
504733005
2238121792
1499822898
1947433726
1972472356
2283886540
950347931
776428656
99475898
2254458042
2912464436
4198669028
2026139872
3551986065
2975321025
2802966087
3911835260
1837778255
2149312528
4135773526
2213679768
3656934230
2101321953
2504503484
181167332
715701665
261621685
50937759
3996340250
2929739620
293360939
4135605150
763296558
3520943566
1496986135
722557687
2359399112
3310059424
1601255737
429645807
2671088709
97199580
3373129377
3233606262
55401725
1218440347
4152609102
1757067021
1675944610
3567736498
1615952057
1825403980
3565447540
1620564015
956233187
428316930
2980048799
1144637340
3929803750
3396494621
1553553640
253777086
2887081231
2979582362
3543843686
949134968
2294024999
323650571
1551701805
3825432133
2627951062
51460899
3084855363
1720745699
1668313575
1750182812
872076732
29236432
595882815
1497073931
3570693439
2030203912
1590868590
3327807354
3403289401
3222781660
1280258276
1708859404
1764607474
2183630092
3198578020
3973085301
2211022289
801687726
1392014389
1794554823
1343217230
338996096
3339603226
3311747717
1291083377
4197209993
3497603794
2342804277
2953746366
1510515635
2238048390
361960380
755702926
3040537530
4208881308
261675267
3778588718
384719475
809338924
573653888
348777112
1949679820
2840947511
1628952109
1075779320
2136993958
210735102
1619081963
469866002
2796237739
3124399746
4101822272
2442762863
3122422521
3897371907
356159526
609224405
1539410786
958517397
3081219417
2023787500
1104918605
3556015352
3076878189
2731822539
3247594399
3716825960
1225332197
2111378249
1227207068
646034361
2520610432
257707112
1173843463
1789159696
669357148
3150370710
2508172420
1568060448
4033545067
1242530896
4202487795
1764798944
348522087
39176288
2113902231
2278094500
2021656103
1699144035
3938239545
1210546962
94876751
3351376499
2209063356
1056746325
1688378391
3892631754
557068931
1998796052
191387162
212497676
1971912720
3108955817
436492675
3252073496
453561842
1205201089
3789426675
3904914439
2499384573
1230482010
534240405
2941327528
3840379695
993179572
1002197751
2400687213
2151711482
182628669
572644817
1702075537
3556107493
3077214108
3804179229
3081974681
2584513959
1947317787
3058940532
4176167668
1286268201
2544932522
1656350636
3253785333
2184270718
3688643231
1156098220
1345341697
797079298
3480779812
1315068927
3166385100
318125013
3967489618
1968729688
3597843587
1764607667
1836089223
980436839
342818098
78002320
2246020656
2656589369
1570286566
3040541147
1470288410
4245578140
3270304328
2365331844
1661146418
3266302121
266035938
250830377
3234458693
1409480898
1931057400
2097357247
1439140979
969480671
2869518769
2761234729
1686692341
4050439301
2858642170
165014117
2300233679
311842903
1794537642
62841699
132273067
1155107399
2977590909
335841393
2582420887
2339205382
481992799
992394823
4243006478
2513959528
3172026183
1165443674
3563154396
1298556636
1887992485
1328306
3402258623
2868877405
1701393562
1437966409
3233866666
1242926562
968122084
1257951788
2536163378
3557667455
2945556839
1349568499
4218968932
933121890
2572459092
1226414842
3153990851
3439911184
205938343
4172202638
566787038
3594120102
288100573
3161669398
2243012096
1204365842
588433730
1352638265
2636843077
1270155437
1844967030
3797523862
1689575358
4124723583
664892187
4282971635
3253593171
1461028268
731354703
2678214864
2716400004
967542470
2843803596
236418225
141828421
2775998229
2375627688
2687834473
544670185
316991083
3907299673
3460715420
3617007159
